rednblkx/HomeKey-ESP32/main/NfcManager.cpp
    ESP_LOGI(TAG,
             "NFC poll tuning active: delay=%lu ms, passiveTimeout=%u ms",
             static_cast<unsigned long>(pollDelayTicks * portTICK_PERIOD_MS),
             static_cast<unsigned int>(passiveTargetTimeoutMs));

    while (true) {
        if (m_reconfigRequested.exchange(false, std::memory_order_acq_rel)) {
          ESP_LOGI(TAG, "ECP Frame update requested...");
          if (m_reader) {
              if (!m_reader->updateECP()) {
                  ESP_LOGE(TAG, "ECP update failed; performing full reader re-initialization.");
                  m_reader->stop();
                  if (!initializeReader()) {
                      vTaskDelay(pdMS_TO_TICKS(1000));
                      continue;
                  }
              }
          }
        }
        if (!m_reader->healthCheck()) {
					ESP_LOGE(TAG, "NFC reader is unresponsive. Attempting to reconnect...");
					while (true) {
						if (initializeReader()) {
							ESP_LOGI(TAG, "Reader reconnected successfully.");
							break;
						}
						ESP_LOGW(TAG, "Reconnect attempt failed. Retrying in 5 seconds...");
						vTaskDelay(pdMS_TO_TICKS(5000));
					}
					continue;
        }

        std::vector<uint8_t> uid;
        std::array<uint8_t,2> atqa;
        uint8_t sak;
        if (m_reader->pollForTag(uid, atqa, sak, passiveTargetTimeoutMs)) {
            ESP_LOGI(TAG, "NFC tag detected!");
            handleTagPresence(uid, atqa, sak);
            waitForTagRemoval();
        }

        vTaskDelay(pollDelayTicks);
        taskYIELD();
    }
}

/**
 * @brief Handles a detected NFC tag by attempting to select the HomeKey applet and processing the tag accordingly.
 *
 * Attempts to select the HomeKey applet on the tag via an APDU select command; if selection succeeds, proceeds with
 * HomeKey authentication handling. If selection fails, reads the tag's UID/ATQA/SAK and processes it as a generic ISO14443A tag.
 * Logs the tag processing duration and releases the reader device state before returning.
 */
void NfcManager::handleTagPresence(const std::vector<uint8_t>& uid, const std::array<uint8_t,2>& atqa, const uint8_t& sak) {
    auto startTime = std::chrono::high_resolution_clock::now();
    uint8_t selectAppletCmd[] = { 0x00, 0xA4, 0x04, 0x00, 0x07, 0xA0, 0x00, 0x00, 0x08, 0x58, 0x01, 0x01, 0x00 };
    std::vector<uint8_t> response;
    bool ok = m_reader->exchangeApdu(std::vector<uint8_t>(selectAppletCmd, selectAppletCmd + sizeof(selectAppletCmd)), response, 500);

    // Check for success SW1=0x90, SW2=0x00
    if (ok && response.size() >= 2 && response[response.size() - 2] == 0x90 && response[response.size() - 1] == 0x00) {
        ESP_LOGI(TAG, "HomeKey applet selected successfully.");
        handleHomeKeyAuth();
    } else {
        ESP_LOGI(TAG, "Not a HomeKey tag, or failed to select applet.");
        ESP_LOGD(TAG, "Passive target UID: %s (%zu)", fmt::format("{:02X}", fmt::join(uid, "")).c_str(), uid.size());
        handleGenericTag(uid, atqa, sak);
    }

    auto stopTime = std::chrono::high_resolution_clock::now();
    ESP_LOGI(TAG, "Total processing time: %lli ms", std::chrono::duration_cast<std::chrono::milliseconds>(stopTime - startTime).count());
    // Headroom check. This task runs mbedTLS P-256 operations (ECDH, ECDSA) on
    // top of the reader's frame buffers, and an overflow here would look
    // exactly like the observed symptom: a reboot part-way through a
    // transaction. Reported every time so a downward trend is visible.
    const UBaseType_t stackFreeWords = uxTaskGetStackHighWaterMark(nullptr);
    if (stackFreeWords < 512) {
      ESP_LOGW(TAG, "nfc task stack headroom LOW: %u bytes free",
               (unsigned)(stackFreeWords * sizeof(StackType_t)));
    } else {
      ESP_LOGD(TAG, "nfc task stack headroom: %u bytes free",
               (unsigned)(stackFreeWords * sizeof(StackType_t)));
    }
    ESP_LOGD(TAG, "heap: %u free, %u min-ever", (unsigned)esp_get_free_heap_size(),
             (unsigned)esp_get_minimum_free_heap_size());

}

/**
 * @brief Block until the active tag leaves the reader's RF field.
 *
 * Spins on `isTagStillPresent()` with a 60 ms delay between checks.  If the
 * tag is not removed within 10 seconds, the reader is force-released and the
 * function returns to avoid an infinite loop.
 */
void NfcManager::waitForTagRemoval() {
    if (!m_reader) return;
    TickType_t start = xTaskGetTickCount();
    while (m_reader->isTagStillPresent()) {
        if ((xTaskGetTickCount() - start) * portTICK_PERIOD_MS > 10000) {
            ESP_LOGW(TAG, "Tag removal wait timed out, forcing release.");
            m_reader->releaseTag();
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(60));
    }
    m_reader->releaseTag();
}

/**
 * @brief Attempt HomeKey authentication for the currently-present NFC tag.
 *
 * Performs the configured HomeKey authentication flow for the active tag and publishes a HOMEKEY_TAP
 * event describing the outcome. On successful authentication, stored reader data may be updated.
 *
 * If HomeKey precomputation is enabled, a precomputed authentication context may be consumed (when
 * generation matches current reader data); otherwise a fresh ("cold") authentication context is used.
 *
 * Side effects: may update ReaderDataManager, publish a HOMEKEY_TAP event on the NFC bus, notify the
 * auth precompute task, and modify internal auth-cache queues.
 */
void NfcManager::handleHomeKeyAuth() {
    auto publishAuthResult = [](
        const AuthContextResult& authResult,
        const std::vector<uint8_t>& readerId
    ) {
        if (authResult.flow != kFlowFailed) {
            ESP_LOGI(TAG, "HomeKey authentication successful!");
            EventHKTap s{.status = true, .issuerId = authResult.issuer_id, .endpointId = authResult.endpoint_id, .readerId = readerId };
            std::vector<uint8_t> d;
            alpaca::serialize(s, d);
            NfcEvent event{.type=HOMEKEY_TAP, .data=d};
            std::vector<uint8_t> event_data;
            alpaca::serialize(event, event_data);
            AppEventLoop::publish(NFC_EVENT, NFC_TAP_EVENT, event_data.data(), event_data.size());
        } else {
            ESP_LOGW(TAG, "HomeKey authentication failed.");
            EventHKTap s{.status = false, .issuerId = {}, .endpointId = {}, .readerId = {} };
            std::vector<uint8_t> d;
            alpaca::serialize(s, d);
            NfcEvent event{.type=HOMEKEY_TAP, .data=d};
            std::vector<uint8_t> event_data;
            alpaca::serialize(event, event_data);
            AppEventLoop::publish(NFC_EVENT, NFC_TAP_EVENT, event_data.data(), event_data.size());
        }
    };

    auto authenticateCold = [this, &publishAuthResult]() {
        readerData_t readerData = m_readerDataManager.getReaderDataCopy();

        // IMPORTANT: HKAuthenticationContext stores references to std::function objects.
        // Do NOT pass lambdas directly (would bind to temporaries and dangle).
        std::function<bool(std::vector<uint8_t>&, std::vector<uint8_t>&, bool)> nfcFn =
            [this](std::vector<uint8_t>& send, std::vector<uint8_t>& recv, bool isLong) -> bool {
                if (!m_reader || send.size() > 255) {
                    return false;
                }
                return m_reader->exchangeApdu(send, recv, isLong ? 1000 : 500);
            };
        std::function<void(const readerData_t&)> saveFn = [this](const readerData_t& data) {
            m_readerDataManager.updateReaderData(data);
            invalidateAuthCache();
        };
        DDKAuthenticationContext authCtx(kHomeKey, nfcFn, readerData, saveFn);
        auto authResult = authCtx.authenticate(authFlow);
        publishAuthResult(authResult, readerData.reader_id);
    };

    if (!m_hkAuthPrecomputeEnabled) {
        authenticateCold();
        return;
    }

    const UBaseType_t readyBefore = m_authCtxReadyQueue ? uxQueueMessagesWaiting(m_authCtxReadyQueue) : 0;
    const UBaseType_t freeBefore = m_authCtxFreeQueue ? uxQueueMessagesWaiting(m_authCtxFreeQueue) : 0;
    const uint32_t genNow = m_readerDataGeneration.load(std::memory_order_relaxed);

